| inputlookup uba_authentication.csv
| eval cim_field_name="count(Authentication.".cim_field_name.")",cim_field_names=""
| stats list(cim_field_name) AS cim_field_names
| nomv cim_field_names
| eval s="| tstats
".cim_field_names."
from datamodel=Authentication
| rename count(Authentication.*) AS *
| transpose
| rename column AS cim_field_name, \"row 1\" as count
"
| map maxsearches=100 search="
| rest /services/search/jobs/export search=\"$s$\"  output_mode=csv| fields value
"
| `rest_format`
| lookup uba_authentication.csv cim_field_name OUTPUT required



| tstats
count(Authentication.action),
count(Authentication.app)
from datamodel=Network_Sessions
where nodename=Network_Sessions.All_Sessions.DHCP
| rename count(Authentication.*) AS *
| transpose
| rename column AS cim_field_name, "row 1" as count
| lookup uba_authentication.csv cim_field_name OUTPUT required
